# === Brew Taps ===

tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"

# === Brew Formulas ===

# C/C++ resolver library and DNS resolver utilities
brew "adns"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Get/set bluetooth power and discoverable state
brew "blueutil"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Reimplementation of ctags(1)
brew "ctags"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# C library implementing the SSH2 protocol
brew "libssh2"
# Open source suite of directory software
brew "openldap"
# Tool for downloading RTMP streaming media
brew "rtmpdump"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Database of common MIME types
brew "shared-mime-info"
# Clean Docker containers, images, networks, and volumes
brew "docker-clean"
# Programming language for highly scalable real-time systems
brew "erlang"
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# Programming language for building efficient and concurrent applications
brew "go"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Core application library for C
brew "glib"
# Asynchronous event library
brew "libevent"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Cryptographic library based on the code from GnuPG
brew "libgcrypt"
# New GNU portable threads library
brew "npth"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# Library for command-line editing
brew "readline"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Library access to GnuPG
brew "gpgme"
# Powerful, lightweight programming language
brew "lua"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Image manipulation library using jpeg
brew "jpeg"
# Image manipulation library using imagemagick
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Interactive process viewer providing a text-mode application for Unix systems
brew "htop"
# Simplified and community-driven man pages
brew "tldr"
# GNOME XML library
brew "libxml2"
# YAML Parser
brew "libyaml"
# Mac App Store command-line interface
brew "mas"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# HTTP/2 C Library
brew "nghttp2"
# Platform built on V8 to build network applications
brew "node"
# Manage multiple Node.js versions
brew "nvm"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Python version management
brew "pyenv"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Rust toolchain installer
brew "rustup-init"
# Intuitive find & replace CLI
brew "sd"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Text interface for Git repositories
brew "tig"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# Tracks most-used directories to make cd smarter
brew "z"
# General-purpose lossless data-compression library
brew "zlib"
# Next-generation plugin manager for zsh
brew "zplug"
# UNIX shell (command interpreter)
brew "zsh"
# Program to manage files on cloud storage services
brew "rclone"

# === Brew Casks ===

# App to build and share containerized applications and microservices
cask "docker"
# Get up and running with large language models locally
cask "ollama"
# Free monospaced font with programming ligatures
cask "font-consolas-for-powerline"
cask "font-roboto-mono"
cask "font-roboto-mono-for-powerline"
# Screensaver that displays the current time in a classic flip clock style
cask "fliqlo"
# Web browser
cask "google-chrome"
# Terminal built on web technologies
cask "hyper"
# Fast and totally extendable launcher
cask "raycast"
# Quicklook extension for source files
cask "syntax-highlight"
# Unpacks archive files
cask "the-unarchiver"
# Open-source code editor
cask "visual-studio-code"

# === Mac App Store ===

mas "Xcode", id: 497799835

# === VSCode Extensions ===

vscode "editorconfig.editorconfig"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "github.copilot"
vscode "github.copilot-chat"
